rm = (list=ls())

prob <- I/m

##practice 17

m <- 100000
x <- rbinom(m ,3, 2/3)
y <- rbinom(m ,3, 2/3)
I <- sum( x==y )
prob <- I/m


##執行一系列的柏努力試驗，直到第1次成功所需要的試驗次數(X)
## X~geometric(p)幾何分配
##第一次 第二次 ...第四次 第五次
##  5/6    5/6 ...  5/6   1/6
##機率 = (5/6)^4 (1/6)
## PDF = (1-p)^(x-1)p , x=1,2,3,4,...
## E(x) = 1/p, V(x)=q/p^2

m <- 10000000

x <- rgeom(m, 0.6)+1   #隨機抽樣的機率分配
                      #記得+1主要是內建指令的定義不同  
EX1 <- mean(x)
EX2 = mean(x^2)
VAR <- EX2 - (EX1)^2

##practice 18
m <- 1000000
x <- rgeom(m, 2/6)+1  #成功機率為2/6
EX1 <- mean(x)

# 
# #負二項分配
# 執行一列柏努力試驗,直到r次成功為止
# 所需要試驗的次數(X)
# X~NBinomial(r, p)
# X~NBinomial(r=1, p) == X~Geometric(p)
# x=r, r+1, r+2,...

m <- 1000000
x <- rnbinom(m, 10,1/6 )+10 #記得+r
EX1 <- mean(x)
Var <- mean(x^2)-(EX1)^2
10*(1-1/6)(1/6)^2


##practice 19
p <- 0.05
r <- 2
m <- 1000000
x <- rnbinom(m, r, p)+r #要加r
prob <- sum(x==25)/m

## 假設手遊抽到某個角色的機率為0.01
## 玩家抽到第六次這隻角色為止所需的次數為何?

p <- 0.01 #成功機率
r <- 6    
m <- 1000000
x <- rnbinom(m, r, p)+r #要加r
EX1 <- mean(x)


## poisson分配
## 單位時間內發生事件的次數(x)
## 逢甲大學(福星路)公車站牌,十分鐘內有x台公車經過
## 高速公路某個路段,一年內發生x次車禍
## 買相同保單的人,三個月內有x人發生事故
## lambda = 平均而言單位時間內發生事件次數
## x=0,1,2,3,4,...
## x~poisson(lambda)
lambda <- 4
m <- 100000

x <- rpois(m, lambda)

EX1 <- mean(x)
Var <- mean(x^2)-(EX1)^2

## practice 20
## 平均一天內會有5人死亡
## X~Poisson( lambda=5 )
## x為保險公司每天對於與王顯出險的數量
## prob(x==4) = ???

lambda <- 5
m <- 1000000
x <- rpois(m, lambda)

prob <- sum(x == 4)/m


## 歐式選擇權、歐式期權(European options)
## 持有一口歐式選擇權,持有方有權利在到期時以約定好的價格買入/賣出標的資產
##
#######
##
## 我跟店家預定一件$1000(約定價格、履約價格)褲子(標的資產)
## 兩個星期(到期日)後買入,我有權利在到期,選擇要不要購買
##
## 買的權力 -> 買權(call options)、看漲期權
##
## 我:選擇權持有人(買方) 有權利
## 店家:選擇權發行人(賣方) 有義務
##
## payoff = max[S(T)-K,0]
##
#########
##
## 我(種荔枝的人)跟消費者約定好在二個禮拜(到期日)後,以$100/斤(履約價格)荔枝(標的資產)
## 我有權利在到期十,選擇要不要賣給對方。
##
## 賣的權利->賣權(put options)、看跌期權
##
## 我:選擇權持有人(買方) 有權利
## 店家:選擇權發行人(賣方) 有義務
##
## payoff = [K-S(T),0]
##
########
## 
## 以時間點0而言,S(T)為隨機變數
## S(0)已知,S(1)未知,S(2)未知,....,S(T)未知
## S(0)->S(1) 假設有兩種可能性:漲S(0)u、 跌S(0)d
##
## 模擬股價
## Binomial tree
u <- 1.05
d <- 0.95
m <- 1000000
S0 <-100 
x <- rbinom(m, 100, 0.25)
ST <- S0*u^x*d^(100-x)

cal <- mean((ST-100)*(ST>100))*exp(-1*0.02*100/365)
put <- mean((100-ST)*(ST<100))*exp(-1*0.02*100/365)